layer {
  name : "input"
  type : "Input"
  top: "input:0"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 224
      dim: 224
    }
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_0/convolution"
  type : "Convolution"
  bottom: "input:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 8
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 2
    stride_w: 2
    pad_n: 0
    pad_s: 1
    pad_w: 0
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_0/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_0/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_0/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 8
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 8
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 16
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 16
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 2
    stride_w: 2
    pad_n: 0
    pad_s: 1
    pad_w: 0
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 16
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 32
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 32
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 32
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 32
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 32
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 2
    stride_w: 2
    pad_n: 0
    pad_s: 1
    pad_w: 0
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 32
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 64
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 64
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 64
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 64
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 64
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 2
    stride_w: 2
    pad_n: 0
    pad_s: 1
    pad_w: 0
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 64
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 128
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 128
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 128
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 128
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 128
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 128
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 2
    stride_w: 2
    pad_n: 0
    pad_s: 1
    pad_w: 0
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 128
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 256
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 256
    kernel_size_h: 3
    kernel_size_w: 3
    stride_h: 1
    stride_w: 1
    pad_n: 1
    pad_s: 1
    pad_w: 1
    pad_e: 1
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 256
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/Relu6:0"
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/Relu6:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/add_1:0"
  convolution_param {
    num_output: 256
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
layer {
  name : "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6"
  type : "ReLU6"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/add_1:0"
  top: "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6:0"
}
layer {
  name : "MobilenetV1/Logits/AvgPool_1a/AvgPool"
  type : "Pooling"
  bottom: "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6:0"
  top: "MobilenetV1/Logits/Dropout_1b/Identity:0"
  pooling_param {
    kernel_size_h: 7
    kernel_size_w: 7
    stride_h: 2
    stride_w: 2
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    dilation_h: 1
    dilation_w: 1
    pool: AVE
  }
}
layer {
  name : "MobilenetV1/Logits/Conv2d_1c_1x1/convolution"
  type : "Convolution"
  bottom: "MobilenetV1/Logits/Dropout_1b/Identity:0"
  top: "MobilenetV1/Logits/Conv2d_1c_1x1/BiasAdd:0"
  convolution_param {
    num_output: 1001
    kernel_size_h: 1
    kernel_size_w: 1
    stride_h: 1
    stride_w: 1
    pad_n: 0
    pad_s: 0
    pad_w: 0
    pad_e: 0
    bias_term: True
    dilation_h: 1
    dilation_w: 1
    group: 1
  }
}
